scripts/paper2/sweep/CaseOrigSemi2/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
generalSource2
{
    type            scalarFixedValueConstraint;
    
    selectionMode   cellZone;
    cellZone         PeSource;
    fieldValues
    {
        UPe           0;
    }

    
}
energySource
{
    type  scalarCodedSource;
    name  testing1;

    scalarCodedSourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        NeSource;          // <-- where to apply the value
        fields          (UNe);

        // ---- controller knobs ----
        jGoal           JJGGOOAALL;              // [A/m^2]
        Kp              1e-2;              // [V/A]
        Ki              0;                 // [V/(A*s)]
        dUmax           0.1;               // [V/update]
        Umin            -10;
        Umax            -1.35;
        initialU        -1.35;
        Nupdate         24;                // update cadence (>=1)
        verbose         true;

        // ---- measurement on a faceZone ----
        faceZoneName    midPlaneZone;      // <-- your faceZone name
        currentField    Ie;                // volVectorField with J (e.g. Ie or INe)

        // no codeOptions/codeLibs needed for faceZone path

        codeInclude
        #{
            #include "volFields.H"
            #include "surfaceFields.H"
            #include "fvc.H"
            #include "faceZoneMesh.H"
            #include "faceZone.H"
            #include "PstreamReduceOps.H"
        #};
        codeCorrect
        #{ 
        #};
        codeAddSup
        #{ // If you prefer a penalized source instead of hard set, move logic here. 
        #};
        codeConstrain
        #{
            using namespace Foam;

            const dictionary& C = this->coeffs();

            // tunables
            const scalar jGoal     = C.lookupOrDefault<scalar>("jGoal", 2000);
            const scalar Kp        = C.lookupOrDefault<scalar>("Kp", 0.1e-2);
            const scalar Ki        = C.lookupOrDefault<scalar>("Ki", 0.0);
            const scalar dUmax     = C.lookupOrDefault<scalar>("dUmax", 0.1);
            const scalar Umin      = C.lookupOrDefault<scalar>("Umin", -10.0);
            const scalar Umax      = C.lookupOrDefault<scalar>("Umax",  10.0);
            const scalar initialU  = C.lookupOrDefault<scalar>("initialU", -1.4);
            label Nupdate          = C.lookupOrDefault<label>("Nupdate", 8);
            const bool verbose     = C.lookupOrDefault<bool>("verbose", true);

            if (Nupdate < 1) Nupdate = 1;

            const word fzName = C.lookupOrDefault<word>("faceZoneName", "midPlaneZone");
            word Jname        = C.lookupOrDefault<word>("currentField", "Ie");

            // mesh, time step
            const fvMesh& m = mesh();
            const scalar dt = m.time().deltaTValue();

            // current-density field (volume vector)
            const volVectorField* Jptr = nullptr;
            if (m.foundObject<volVectorField>(Jname))
            {
                Jptr = &m.lookupObject<volVectorField>(Jname);
            }
            else
            {
                FatalErrorInFunction
                    << "Field '" << Jname << "' not found as volVectorField."
                    << exit(FatalError);
            }
            const volVectorField& J = *Jptr;

            // faceZone lookup
            const faceZoneMesh& fzMesh = m.faceZones();
            const label fzId = fzMesh.findZoneID(fzName);
            if (fzId < 0)
            {
                FatalErrorInFunction
                    << "faceZone '" << fzName << "' not found. Create it with topoSet/setSet."
                    << exit(FatalError);
            }
            const faceZone& fz = fzMesh[fzId];

            if (fz.empty())
            {
                if (verbose) Info<<"PID source: faceZone '"<<fzName<<"' is empty. Keeping previous U.\n";
            }

            // interpolate J to faces
            const tmp<surfaceVectorField> tJf = fvc::interpolate(J);
            const surfaceVectorField& Jf = tJf();

            const vectorField& SfAll = m.Sf();       // area vectors for all faces
            const labelList& faces   = fz;//.faceLabels();
            const boolList& flip     = fz.flipMap();

            // integrate I and area A over the faceZone (with orientation)
            scalar I_local = 0.0;
            scalar A_local = 0.0;

            forAll(faces, i)
            {
                const label faceI = faces[i];
                vector s = SfAll[faceI];
                if (flip[i]) s = -s;                // unify orientation across the zone

                I_local += (Jf[faceI] & s);
                A_local += mag(s);
            }

            // global reductions
            reduce(I_local, sumOp<scalar>());
            reduce(A_local, sumOp<scalar>());

            const scalar I = mag(I_local);          // [A]
            const scalar A = A_local;               // [m^2]

            if (A <= SMALL && verbose)
            {
                Info<<"PID source: faceZone area ~ 0, skipping update.\n";
            }

            const scalar Igoal = jGoal * A;         // [A]
            const scalar e     = Igoal - I;         // [A]

            // controller state
            static scalar U    = initialU;
            static scalar eInt = 0.0;
            static label  k    = 0;

            // PI + ramp + clamp
            if ((++k % Nupdate) == 0 && A > SMALL)
            {
            Info<<"*    updating UNe*"<<endl;
                if ( !((U <= Umin && e < 0) || (U >= Umax && e > 0)) )
                {
                    eInt += e*dt;
                }
                scalar dU = Kp*e + Ki*eInt;
                dU = max(-dUmax, min(dUmax, dU));
                U -= dU;
                U  = max(Umin, min(Umax, U));
            }
            else
            {
                U = max(Umin, min(Umax, U));
            }

            
                Info<< "    PID source (faceZone '"<<fzName<<"'): "
                    << "I=" << I << " A, A=" << A << " m^2, "
                    << "Igoal=" << Igoal << " A, e=" << e
                    << " A, eInt=" << eInt << ", U=" << U << " V\n";
            

            // apply uniform value to selected cells
            eqn.setValues(cells_, U);
        #};
    }
}




// ************************************************************************* //
