scripts/paper2/sweep/CaseOrigSemi2/constant/porousProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


as_Ne		4920;//latest from Marcus;
as_Pe		4920;//latest from Marcus;
K_Pe        #eval{1.310615989515072e-09};//increased by 10
K_Ne        $K_Pe;
K_Mem       #eval{1/8.85e18};
D_pore_Ne		0.06e-3;
D_pore_Pe		0.06e-3;
sigma_s_ref	1.43e7;




// ************************************************************************* //
