scripts/paper2/sweep/CaseOrigSemi2/0.orig/C_OH.electrolyte
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_OH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 1000;

boundaryField
{
    PPe
    {
	type		zeroGradient;
    }
    PNe
    {
	type		zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }

    Inlet1
    {
    	type		fixedValue;
    	value		uniform 1000;
    }
    Inlet2
    {
    	type		fixedValue;
    	value		uniform 1000;
    }
    Outlet1
    {
        type            zeroGradient;
    }
    Outlet2
    {
        type            zeroGradient;
    }
        OWall
    {
	type 		zeroGradient;
        
    }
    Walls
    {
	type 		zeroGradient;
        //	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
